{"Bread":[{"recipe_name":"Apple Bread","ingredients":["1 cup sugar"," 2 eggs"," 1 cup grated apples"," 1/2 cup nuts"," 1 teaspoon vanilla"," 2 cups flour"," 1/2 cup shortening or oil"," 1/2 teaspoon salt"," 1/3 cup buttermilk or sour milk"," 1 teaspoon soda"],"directions":[" Mix together.  Top with 1 teaspoon cinnamon mixed with 3 tablespoons sugar.  Bake 1 hour at 350. "]},{"recipe_name":"Baking Powder Biscuits","ingredients":[" 2 cups flour"," 4 teaspoons baking powder"," 2 tablespoons sugar"," 1/2 teaspoon salt"," 1/2 teaspoon cream of tartar"," 1/2 cup shortening"," 2/3 cup milk"],"directions":[" Sift together flour, baking powder, sugar, salt, cream of tartar.  Cut in shortening.  Add milk.  Mix and roll.  Bake at 375-400 for 12-15 minutes. "]},{"recipe_name":"Balloon Buns","ingredients":[" Traditional roll dough or Quick sour cream dough"," 1 tablespoon cinnamon"," 1 cup sugar"," 18 to 24 large marshmallows"," 1/2 cup butter or margarine, melted"," Divide dough in half.  Roll each half about 1/4 inch thick.  Cut into 3 1/2 inch circles.  Mix cinnamon and sugar.  Dip each marshmallow in butter, then into cinnamon-sugar mixture.  Wrap dough around marshmallow, pinching tightly at the bottom.  Dip roll in butter, then in cinnamon-sugar mixture.  Place in greased medium muffin cups (2 3/4 inches in diameter).  Let rise until double.  Bake 20 to 25 minutes at 375."]},{"recipe_name":"Banana Bread","ingredients":[" 1/2 cup shortening"," 1 cup sugar"," 2 eggs"," 3 real ripe bananas"," 2 cups sifted flour"," 1 teaspoon soda"," 1/4 teaspoon salt"," 1/2 cup nuts"],"directions":[" Cream shortening and sugar.  Add eggs, then the rest.  Pour into loaf pan.  Bake at 375 for 1 hour."]},{"recipe_name":"Butter Dips (Shelley Hawker, BYU 109th)","ingredients":[" 1/4 cup butter or margarine"," 1 1/4 cup flour"," 2/3 cup milk"," 2 teaspoons baking powder"," 2 teaspoons sugar"," 1 teaspoon salt"],"directions":[" Heat oven to 450.  In square 9x9x2 inch pan, melt butter in oven.  Remove pan from oven.  Measure dry ingredients, add milk and stir until dough forms.  Turn dough onto board and knead lightly.  Roll into 8 inch square.  With floured knife, cut dough in half and then into 9 four-inch strips.  Dip each strip in butter, coating both sides.  Arrange close together in 2 rows in pan.  Bake 15-20 minutes or until golden brown.  Makes about 18 sticks."]},{"recipe_name":"Chili-Cheese Corn Bread","ingredients":[" 1 3/4 cup flour"," 1/4 cup corn meal"," 3 tablespoons baking powder"," 1 teaspoon salt"," 1 egg"," 1 cup milk"," 1/2 cup shredded cheddar cheese"," 1 cup whole kernel corn, drained"," 1/4 cup salad oil"," 1 can chili con carne"],"directions":[" Measure all ingredients except chili into bowl; stir just until flour is moistened.  Spread chili in bottom of 8 inch square pan.  Top with batter.  Bake 45 minutes at 375 or until golden brown."]},{"recipe_name":"Corn Bread","ingredients":[" 3 cups cornmeal "," 1 cup flour "," 1 tablespoon baking powder "," 1 teaspoon soda "," 1 teaspoon salt "," 4 large eggs "," 2 1/2 cups buttermilk "," 6 tablespoons butter "," 1/4 cup brown sugar "],"directions":[" Bake at 425 for 15 minutes."]},{"recipe_name":"Croissants, Easy and Elegant","ingredients":[" 4 cups flour, stirred, measured, and leveled"," 1 cup (2 sticks) well chilled butter"," 1 cup warm water (105-115)"," 2 tablespoons sugar"," 1 tablespoon active dry yeast"," 1 1/2 teaspoons salt"," 3/4 cup evaporated milk"," 1 large egg"," 1 cup flour, stirred, measured, and leveled"," 1/2 cup (1 stick) butter, melted"," 1 small egg or 1 egg yolk"," 2 tablespoons evaporated milk"],"directions":[" For dough, measure 4 cups flour into mixing bowl.  Cut chilled butter into flour with pastry blender until size of kidney beans.  Set aside. In large bowl, combine warm water and sugar.  Sprinkle yeast over mixture, set aside to cool for 5 minutes. To dissolved yeast add salt, evaporated milk, 1 large egg, and 1 cup flour.  beat on medium speed with mixer or use wire whisk until batter is smooth.  Stir in melted butter. Pour yeast mixture over flour-butter mixture.  Stir with wooden spoon only enough to moisten flour; do not beat.  Cover bowl; chill 2 hours or as long as 1 week. Three hours before serving, remove dough from bowl and turn dough onto floured cloth or board.  Knead very lightly once or twice to coat with flour and remove air bubbles.  Divide dough into fourths.  Roll each fourth into a 14-inch circle.  Cut into 8 or 12 wedges, depending upon size of croissant desired.  Roll each pie-shaped wedge loosely to form crescent, pulling point to elongate and stretching wide and even wider.  Set onto ungreased baking sheet with point tucked underneath and ends curved downward.  Repeat with other portions. Cover rolls and let rise 2 hours in cool place.  Before baking, brush with glaze made by blending together small egg and 2 tablespoons evaporated milk.  Bake at 375 for 15-20 minutes or until golden brown.  Remove from baking sheets. Makes 32 or 48 rolls."]},{"recipe_name":"French Bread","ingredients":[" 2 tablespoons dry yeast"," 2 tablespoons sugar"," 1 tablespoon salt"," 3 cups water"," 2 tablespoons oil or shortening"," 8 cups flour (approximately)"],"directions":[" Dissolve yeast in 1/2 cup of the water.  Add sugar, salt, oil, and remaining water.  Add half of the flour and mix well.  Add remaining flour to make a soft dough.  Knead well.  Let rise 10 minutes, then punch down.  Repeat five times.  Mold into four loaves.  Cut 1 inch deep slashes across loaves every 2-3 inches (if desired).  Brush with egg white and sprinkle with sesame seeds.  Let rise until double.  Bake 30 minutes at 400."]},{"recipe_name":"Lemon Bread","ingredients":[" 1/2 cup shortening or margarine"," 1 cup sugar"," 2 eggs"," 1/2 cup milk"," 1 1/2 cup flour"," 1 teaspoon salt"," 1 teaspoon baking powder"," 1 grated lemon rind"," ---"," juice from one lemon"," 1/2 cup sugar"],"directions":[" Mix ingredients in order except lemon juice and 1/2 cup sugar.  Pour into loaf pan.  Bake in oven preheated to 300 until done (about 1 hour)."]},{"recipe_name":"Popovers","ingredients":[" 1 cup sifted flour"," 3/4 teaspoon salt"," 2 eggs"," 1 cup milk"],"directions":[" Preheat over to 425.  Grease muffin tins or custard dishes.  Put all ingredients into mixing bowl; beat until smooth--no longer.  Pour into cups, filling 2/3 full.  Bake 40-45 minutes.  Serve at once."]},{"recipe_name":"Pretzels, Cheesy","ingredients":[" 1 1/2 cups flour"," 2/3 cup milk"," 1/2 cup shredded cheddar cheese"," 2 tablespoons butter, softened"," 2 teaspoons baking powder"," 1 teaspoon sugar"," 1 teaspoon salt"," 1 egg, beaten"," coarse salt"],"directions":[" Mix flour, milk, cheese, butter, baking powder, sugar, and salt with a fork until a soft dough forms.  Knead on floured board 10 times.  Divide dough in half.  Roll half of the dough into an 8x12-inch rectangle.  Cut into eight 1-inch strips.  Fold each strip lengthwise in half.  Pinch edges to seal.  Repeat with other half.  Twist into a pretzel shape.  Place on greased cookie sheet.  Brush with beaten egg. Sprinkle with coarse salt.  Bake at 400 for 20 minutes or until golden brown."," Variation: In place of butter use 2 tablespoons crunchy peanut butter.  Omit cheese.  Top with 2 tablespoons chopped salted peanuts instead of coarse salt. "]},{"recipe_name":"Rolls: Cinnamon, Two-Hour (Grandma Lucas)","ingredients":[" 2 tablespoons yeast"," 1/2 cup warm water"," 1/2 cup milk"," 1/2 cup sugar"," 3 eggs, beaten"," 3 tablespoon shortening or oil"," 1 teaspoon salt"," 4 cups flour"],"directions":[" Dissolve yeast in warm water.  Add remaining ingredients (dough will be quite soft, but add a little more flour if it is really sticky).  Let raise 2 hours.  Place on greased surface.  Pat out with hands to about 12 inches square.  Spread with butter and sprinkle with a mixture of sugar and cinnamon.  Add nuts or raisins, if desired.  Roll up like a jelly roll.  Cut and place on baking sheet, just touching.  Let raise 20 minutes.  Bake 10-15 minutes at 400. "]},{"recipe_name":"Judy's Rolls","ingredients":[" 2 tablespoons yeast"," 1/2 cup warm water"," 1 teaspoon sugar"," 12 cups flour"," 2 tablespoons salt"," 1/2 cup sugar"," 1/3 cup dry milk"," 5 tablespoons butter"," 2 eggs"," 2 teaspoons vanilla (optional)"," 3 3/4 cups hot water"],"directions":[" Put yeast, warm water, and sugar in blender.  Put flour, salt, sugar, and dry milk in large mixing bowl.  Add butter, eggs, vanilla, and hot water to blender and blend.  Make a well in dry ingredients, add wet to dry, stir up and let sit in warm oven (lowest setting turned off).Knead until completely mixed.  Let rise good once covered by damp towel.  Punch down and let rise again.  Shape and let rise on cookie sheet for about 45 minutes.  Bake at 350 for about 20 minutes.  (Makes 50+ rolls) "]},{"recipe_name":"Lion House Rolls","ingredients":[" 2 tablespoons dry yeast (2 packets)"," 2 cups warm water (110-115)"," 1/3 cup sugar"," 1/3 cup shortening (or 1 tablespoon olive oil)"," 2 1/2 teaspoons salt (1/2 teaspoon)"," 2/3 cup nonfat dry milk"," 5 to 6 cups flour"," 1 egg (2 egg whites)"],"directions":[" Combine yeast and water, let stand 5 minutes.  Add sugar, shortening, salt, dry milk, 2 cups of flour and egg.  Beat together until very smooth.  Add 2 more cups flour, one at a time and beat until very smooth.  Add 1 more cup 1/2 cup at a time until well mixed.  Dough will be sticky.  Knead and let rise until tripled in bulk (can use 1 teaspoon of oil on board instead of flour).  Shape and let rise for about 1 1/2 hours (use 1 teaspoon oil in pan to coat surface).  Bake at 400 for 15 to 20 minutes.  Makes about 3 dozen. "]},{"recipe_name":"Orange Rolls","ingredients":[" 2 tablespoons yeast"," 1/4 cup lukewarm water"," 1 teaspoon sugar"," ----"," 1 cup water"," 1/2 cup shortening"," 1/2 cup sugar"," 2 teaspoons salt"," ----"," 3 eggs"," ----"," 4 1/2 cups flour"],"directions":[" Combine yeast, lukewarm water, and sugar in mixing bowl and let stand until dissolved.Heat water, shortening, sugar, and salt in pan until sugar is dissolved.  Set aside to cool.Beat eggs well and add to yeast mixture.  Add cooled shortening-sugar mixture to yeast mixture.  Add flour and beat until smooth.  Let dough rise until double (about 10 minutes).  Stir down, cover, and chill 8 hours or overnight.  Roll out 2-3 hours before ready to bake.  "," 1/2 cup sugar grated rind of 1 orange 6 tablespoons butter 2 tablespoons orange juice Combine sugar, orange rind, butter, and orange juice."," Divide dough into 3 parts and roll into rectangles about 12 inches long.  Spread 1/3 of topping mixture on dough and roll up like a jelly roll.  Cut into 12 pieces.  Place in greased muffin tins and let rise 2-3 hours.  Bake at 400 degrees for 8 minutes. "]},{"recipe_name":"Bread Sticks","ingredients":[" 1 tablespoon active dry yeast"," 1 tablespoon honey"," 1 1/2 cups warm water (115)"," 1 tablespoon malted milk powder"," 1 teaspoon salt"," 4 to 4 1/2 cups flour (stirred and measured)"],"directions":[" In large mixing bowl soften yeast and honey in warm water.  Add malted milk powder and salt, blend.  Add flour gradually, blending in with wooden spoon until dough pulls away from sides of bowl to form a ball. Divide dough into 12 pieces.  Roll each piece between hands to make sticks up to 12 inches long.  Place lengthwise on large greased baking sheets.  Brush with beaten eggs.  Sprinkle with desired seasonings: coarse salt, poppy or sesame seeds, Parmesan cheese, etc. Allow to rise 10 to 15 minutes if desired, but not necessary.  Bake at 400 for 15 minutes or until brown."]},{"recipe_name":"Sweet Potato Bread","ingredients":[" 1 cup mashed sweet potatoes "," 1/4 cup milk "," 1 large egg "," 2 cups bread flour "," 1 cup wheat flour "," 1 tablespoon brown sugar "," 1/4 teaspoon salt "," 1/2 teaspoon cinnamon "," 1/4 teaspoon nutmeg "," 1 1/4 teaspoon yeast "," 2 tablespoons butter"],"directions":[" Add ingredients to bread machine.  Cook on normal white bread cycle. "]},{"recipe_name":"Tortillas, Flour","ingredients":[" 2 cups flour"," 1/4 cup shortening"," 1/2 teaspoon salt"," 1/2 cup water"],"directions":[" Cut shortening into flour.  Roll into 1 inch balls.  Roll thin.  Cook on lightly oiled grill (400-450). "]},{"recipe_name":"Whole Wheat (Lynn Winn)","ingredients":[" 2 tablespoons dry yeast"," 1/2 cup warm water"," 3 cups hot water"," 2/3 cup brown sugar"," 4 teaspoons salt"," 6 tablespoons oil"," 4 cups whole wheat flour"," 2 cups white flour"],"directions":[" Dissolve yeast in warm water.  Mix well.  Add up to 4 1/2 cups white flour to form soft dough (dough should be slightly sticky, but easily handled).  Let rise 1 1/2 hours.  Form into loaves (2 or 3, depending on size of loaf pan).  Place loaves into greased pans and let rise 1 hour or more.  Bake at 375 for 15 minutes; reduce heat to 350 until done (about 30 minutes). "]}]}