{"Cake":[{"recipe_name":"Angel Food","ingredients":[" 1 1/2 cup egg whites (12 xlarge) at room temperature"," 1 cup + 2 tablespoons sifted cake flour"," 3/4 cup sifted sugar"," 1/2 teaspoon salt"," 1 1/2 teaspoon cream of tartar"," 1 cup sifted sugar"," 1 teaspoon vanilla (or almond flavoring)"],"directions":[" Heat oven to 375.  Sift flour, 3/4 cup sugar five times, set aside.  Beat whites and salt until foamy.  Add cream of tartar, beat until stiff (2 1/2 minutes).  Add 1 cup of sugarrapidly sprinkle in while mixingjust until blended (1 minute).  Add vanilla.  While mixing at low speed, sprinkle in flour-sugar mixture (1 1/2 minutes).  Scrape bowl.  Push into ungreased tube pan.  Cut through with knife to release air bubbles.  Bake 35 minutes.  Invert pan over rack until cool. "]},{"recipe_name":"Argentina Chocolate Cake","ingredients":[" 1 1/2 cups flour"," 1 cup sugar"," 1 teaspoon soda"," 3 tablespoons cocoa"," 1 tablespoon vinegar"," 1 teaspoon vanilla"," 6 tablespoons oil"," 1 cup cold water"],"directions":[" Sift together flour, sugar, soda, and cocoa.  Make 3 holes in mixture and put vinegar, vanilla, and oil each into a hole.  Pour cold water over all, mix well.  Bake 30 minutes at 350 "]},{"recipe_name":"Banana Nut (Susan)","ingredients":[" 1 1/2 cup sugar"," 1/2 cup butter"," 2 egg yolks, beaten"," 1/2 cup sour milk"," 1 teaspoon soda"," 1/2 teaspoon salt"," 1/4 cup hot water"," 2 cups whole wheat flour"," 2 teaspoons baking powder"," 4 mashed bananas"," 1 teaspoon vanilla"," 1 cup chopped nuts"," 2 egg whites"],"directions":[" Cream butter and sugar.  Add egg yolks, milk, soda, salt, and hot water.  Mix well.  Add bananas, vanilla and nuts.  Fold in egg whites.  Bake in 9x12 pan at 350 for 20 minutes or more. "]},{"recipe_name":"Chocolate-Almond Wedding Cake","ingredients":[" 1 pound butter"," 2 1/2 cups sugar + 1/4 cup sugar"," 12 eggs, separated"," 1 pound melted semisweet chocolate"," 3 cups sifted cake flour"," 1 teaspoon almond extract"," 1 1/2 cups blanched almonds, finely ground"," pinch salt"],"directions":[" Preheat oven to 350.  Grease and wax paper four 9-inch round cake pans. Cream butter and 2 1/2 cups sugar until fluffy.  Add egg yolks one at a time, beating well after each addition.  Beat until mixture is thick and pale yellow. Stir in melted chocolate just until incorporated.  Stir in flour, almond extract, and almonds, mixing until just incorporated. Beat egg whites to soft peaks.  Add salt and 1/4 cup sugar.  Beat until mixture reaches meringue-like consistency.  Fold into chocolate mixture. Spread batter into pans.  Bake 25 minutes or until edges are set (the center may be slightly underdone).  Cool on wire rack for 10 minutes.  Remove from pans and cool completely.  Wrap and freeze layers before assembling. "]},{"recipe_name":"Darn Good Chocolate Cake (newspaper)","ingredients":[" 1 package (18.25 oz) Devil's food or dark chocolate fudge cake mix"," 1 package (3.9 oz) instant chocolate pudding mix"," 4 large eggs"," 1 cup sour cream"," 1/2 cup warm water"," 1/2 cup vegetable oil"," 11/2 cup semisweet chocolate chips"],"directions":[" Preheat over to 350.  Butter and flour a 12-cup Bundt pan.  Mix cake mix, pudding, eggs, sour cream, water, and oil at low speed for 1 minute.  Scrape sides of pan and beat 2 to 3 minutes more.  Fold in chocolate chips.  Pour into pan.  Bake for 45-50 minutes.  Cool for 20-30 minutes then invert from pan. "]},{"recipe_name":"Fudge Cake, Vicki's","ingredients":[" 1 cup water"," 2 squares chocolate"," 1 1/2 cup flour"," 1/4 teaspoon baking soda"," 1 teaspoon salt"," 1/4 cup butter"," 1 cup sugar"," 1 egg"],"directions":[" Cook chocolate in water until thick, set aside to cool.  Sift together flour, baking soda, and salt. Mix together butter and sugar.  Add egg.  Add flour and chocolate mixtures alternately to sugar mixture.  Bake in greased square pan at 350 for 20-30 min."," Frosting: 2 squares chocolate 1 cup sugar 3 1/2 teaspoons cornstarch 1/4 teaspoon salt 1 cup boiling water 1 tablespoon butter 1 teaspoon vanilla"," Melt chocolate in pan.  Mix together sugar, cornstarch, and salt, and add to chocolate.  Add boiling water and cook until thick.  Remove from heat and add butter and vanilla "]},{"recipe_name":"Cake Frosting, 5 minute","ingredients":[" (whole recipe)"," 2 egg whites unbeaten"," 1/8 teaspoon salt"," 1/2 cup cold water"," 11/2 cup sugar"," 1/2 teaspoon cream of tartar"," 1 tablespoon corn syrup"," 1 teaspoon vanilla"],"directions":[" (half recipe) 1 egg whites, unbeaten pinch salt 1/4 cup cold water 3/4 cup sugar 1/4 teaspoon cream of tartar 1/2 tablespoon corn syrup 1/2 teaspoon vanilla Place everything except vanilla in top of double boiler.  Beat at high speed for 4 or 5 minutes until mixture forms peaks.  Add vanilla.  "]},{"recipe_name":"Genoa","ingredients":[" 1 cup eggs"," 1 cup sugar"," 1/2 teaspoon salt"," 1 teaspoon vanilla"," 1 1/2 cup sifted flour"],"directions":[" Beat eggs until light and fluffy.  Add sugar slowly.  Add salt and vanilla, beat until thick and lemony.  Fold in flour.  Pour into two deep round pans lined with waxed paper.  Bake at 350for 25-30 minutes. Cool and split into 4 layers."," Pudding: 1 1/2 cup sugar 1/4 cup corn starch 6 eggs 3 cups milk"," Mix together sugar and cornstarch.  Add eggs and beat well.  Stir milk.  Cook on medium heat until thick, stirring occasionally."," Chocolate: 1 square chocolate melted 1/2 cup sugar 1 1/2 tablespoons corn starch dash salt 1/2 cup boiling water 1 tablespoon butter 1 teaspoon vanilla"," Add chocolate, sugar, cornstarch, and salt to boiling water.  Boil until thick.  Remove from heat.  Add butter and vanilla. "]},{"recipe_name":"German Sweet Chocolate Cake","ingredients":[" 1 package (4 ounces) Bakers Germans Sweet Chocolate"," 1/2 cup water"," 2 cups flour"," 1 teaspoon baking soda"," 1/4 teaspoon salt"," 1 cup butter"," 2 cups sugar"," 4 eggs, separated"," 1 teaspoon vanilla"," 1 cup buttermilk"],"directions":[" Melt chocolate in water.  Mix flour, baking soda, and salt; set aside. Beat butter and sugar until light and fluffy.  Add egg yolks one at a time, beating well after each.  Stir in chocolate mixture and vanilla.  Add flour mixture alternately with buttermilk, beating after each addition until smooth.  In another bowl, beat egg whites until soft peaks form.  Gently stir into batter.  Pour into three 9--inch round pans.  Bake 30 minutes at 350.  Top with Coconut-Pecan frosting."]},{"recipe_name":"Coconut-Pecan Frosting","ingredients":[" 1 can (12 ounces) evaporated milk"," 11/2 cups sugar"," 3/4 cup butter"," 4 egg yolks, slightly beaten"," 11/2 teaspoons vanilla"," 7 ounces flake coconut"," 11/2 cups pecans, chopped"],"directions":[" Mix milk, sugar, butter, egg yolks, and vanilla in large saucepan.  Cook and stir on medium heat about 12 minutes or until thickened and golden brown.  Remove from heat.  Stir in coconut and pecans.  Beat until cool and of spreading consistency. "]},{"recipe_name":"Pound Cake","ingredients":[" 3 sticks butter"," 1 (8 ounce) package cream cheese"," 3 cups sugar"," 6 eggs"," 3 cups cake flour"," 1/4 teaspoon salt"," 2 teaspoons vanilla"],"directions":[" Soften cream cheese and butter, then cream.  Add sugar and mix well (about 5 minutes).  Add eggs one at a time, mixing well after each addition.  Add salt and vanilla.  Then add flour 1 cup at a timemix sparingly.  Put into greased, floured pound cake pan.  Bake at 350 for 1 hour and 15 minutes. Judy uses just flour and 1/2 teaspoon salt.  She mixes a lot before adding flour.  Wrap after taken out of pan to keep moist. "]},{"recipe_name":"Kerstein (Jean Stevens)","ingredients":[" 3 eggs"," 1 cup sugar"," 2 tablespoons almond extract"," 1/2 cup oil"," 1 teaspoon salt"," 1 cup flour"," sliced almonds"],"directions":[" Beat together eggs and sugar.  Add almond extract and oil.  Combine salt with flour, then add to egg mixture.  Grease and flour 2 pie pans.  Spoon batter into pans, sprinkle with almonds.  Bake at 350 for 20 minutes. "]},{"recipe_name":"Stack Cake","ingredients":[" 1 cup butter or margarine"," 1 cup sugar"," 1 cup molasses"," 3 eggs"," 4 cups flour"," 1 teaspoon baking soda"," 1 teaspoon salt"," 1 cup milk"," 2 jars (161/2 ounce) chunk-style spiced applesauce"," whipped cream"," nuts"],"directions":[" Cream butter and sugar.  Stir in molasses.  Add eggs one at a time.  Stir together flour, soda, salt, and add to creamed mixture alternately with milk, beating after each.  Grease flour and flour six 8 inch round pans (or 3 pans twice).  Bake at 375 about 15 minutes.  Cool 5 minutes, remove from pans and cool on rack.  Spread applesauce between layers.  Spread whipped cream on top and sprinkle with nuts. "]},{"recipe_name":"Stripe-it-rich Cake","ingredients":[" 1 package cake mix (can be pudding included)"," 2 packages (4-serving size) pudding"," 1 cup powdered sugar"," 4 cups milk"," 2 tablespoons butter"],"directions":[" Prepare cake mix as directed.  Bake in 9x13 pan. Remove from oven.  Using a wooden spoon, poke holes all the way through cake at 1 inch intervals.Now, combine pudding mix with sugar in saucepan.  Stir in milk.  Add butter.  Cook and stir over medium heat until mixture comes to a full boil.  Quickly pour hot pudding evenly over warm cake, into the holes and over the top to frost the cake.  Chill at least two hours.  Keep refrigerated. "]},{"recipe_name":"Tres Leche, Chocolate","ingredients":[" 3/4 cup sifted cake flour"," 2 tablespoons cocoa"," 1 cup sugar"," 4 eggs"," 2 egg yolks"," 4 teaspoons vegetable oil"," 2 cups evaporated milk"," 3 tablespoons sweetened condensed milk"," 1 cup whipping cream"," 2 tablespoons chocolate syrup"," 1/4 cup powdered sugar"," 1 tablespoon cocoa"," 1 cup whipping cream"]}]}