{"MainDish":[{"recipe_name":"Barbequed Beef","ingredients":[" 2 pounds hamburger"," 1 onion"," 2 cups catsup or 1 can tomato sauce"," dash Worcestershire sauce"," 1 tablespoon chili power or (1 package sloppy Joe mix)"," 1 teaspoon mustard"],"directions":[" Brown hamburger and onion.  Add other ingredients and simmer (may add small amount of water). "]},{"recipe_name":"Barbecued Pork Carolina Style","ingredients":[" 2 onions, quartered"," 2 tablespoons brown sugar"," 1 tablespoon paprika"," 2 teaspoons salt"," 1/2 teaspoon pepper"," 4-6 pound boneless pork butt or shoulder roast"," 3/4 cup cider vinegar"," 4 teaspoons Worcestershire sauce"," 1 1/2 teaspoon crushed red pepper flakes"," 1 1/2 teaspoon sugar"," 1/2 teaspoon dry mustard"," 1/2 teaspoon garlic salt"," 1/4 teaspoon cayenne"],"directions":[" Place onions in slow cooker.  Combine brown sugar, paprika, salt, and pepper.  Rub over roast.  Place roast over onions.  Combine vinegar, Worcestershire sauce, red pepper flakes, sugar, mustard, garlic salt, and cayenne.  Stir to mix well.  Drizzle about 1/3 of vinegar mixture over roast.  Cover and refrigerate remaining vinegar mixture.  Cover; cook on low 8 to 10 hours (or high 4 to 6 hours).  Drizzle about 1/3 of reserved vinegar mixture over roast during last 30 minutes. Remove meat and onions.  Drain.  Shred meat and chop onions.  Serve meat and onions on buns or a sourdough roll.  Drizzle remaining vinegar mixture over sandwich. "]},{"recipe_name":"Casserole: Cathryn's Chicken","ingredients":[" 1 whole or 4 breasts chicken"," 1-2 cans cream soup"," 1/2 can milk"," grated Swiss cheese"," 1-2 cubes butter"," 1 small package seasoned stuffing mix"],"directions":[" Boil and de-bone, then break into bite-sized pieces.  Put in buttered 9x13 pan.  Mix soup with milk, spread on chicken.  Sprinkle with Swiss cheese.  Melt butter and stir in stuffing mix.  Spread on casserole.  Cover with foil and bake 30 minutes at 350. "]},{"recipe_name":"Casserole: Hamburger-Macaroni (Grandma A)","ingredients":[" 1 pound hamburger"," 1/2 pound sausage"," 1 small onion, chopped"," 1 teaspoon green pepper"," 2 cups boiled, salted, drained macaroni"," 2 cups tomato soup"," 2 teaspoon chili powder"," 8 teaspoons pepper"," 1 cup corn"],"directions":[" Brown hamburger, sausage, onion, and pepper.  Add macaroni, soup, chili powder, pepper and corn.  Bake covered for 30-40 minutes at 300. "]},{"recipe_name":"Casserole: Mock Enchilada ","ingredients":[" 1 pound ground beef"," 1 small onion, chopped"," 1 can chili with beans (15 1/2 oz)"," 1 can tomato sauce (8 oz)"," 1/2 teaspoon garlic salt"," 1/8 teaspoon pepper"," 1/2 package of corn chips (6 oz)"," 1/4 pound grated cheese"],"directions":[" Brown meat and onion.  Add chili, tomato sauce, garlic salt, and pepper.  Stir together.  Simmer 10 minutes.  Layer corn chips, beef-chili, and cheese (repeatedly) in 2 quart casserole.  Bake 15-20 minutes at 350.  Serves 4-6. "]},{"recipe_name":"Casserole: Poor Man's Pie","ingredients":[" 1 pound hamburger"," chopped onions (if desired)"," 1 can tomato soup"," 1 can string beans (or other vegetables)"," grated cheese"," mashed potatoes"],"directions":[" Brown hamburger and onions.  Put in casserole dish.  Mix in tomato soup and vegetables.  Cover with mashed potatoes and top with grated cheese.  Bake at 350-375 until hot (about 1/2 hour). "]},{"recipe_name":"Casserole: Quick Spaghetti","ingredients":[" 1 pound hamburger"," 1 onion"," green pepper"," 1/2 cup diced celery"," ---"," 1 cup water"," 1 1/2 cups tomatoes"," 1 teaspoon sugar"," 1 teaspoon salt"," 1/2 cup catsup"," 1/4 teaspoon pepper"," 1 cup salad macaroni"],"directions":[" Brown hamburger, onion, pepper, and celery.  Add water, tomatoes, sugar, salt, catsup, and pepper.  Bring to boil and add macaroni.  Cover and let stand 45 minutes without heat. "]},{"recipe_name":"Casserole: Tater Tot","ingredients":[" 1 pound hamburger"," 1 package Lipton Onion Soup"," 1 can cream of mushroom soup"," 1 can cream of chicken soup"," Tater Tots"],"directions":[" Brow hamburger and place in bottom of dish.  Sprinkle onion soup over hamburger.  Pour cream soups over all.  Line top with Tater Tots.  Bake (at 350) until bubbly and potatoes are browned. "]},{"recipe_name":"Casserole: Tuna","ingredients":[" 1 cup frozen peas"," 1 can mushroom soup"," 2 eggs, beaten"," 1 small can milk"," 1 cup soda cracker crumbs"," 1 teaspoon minced onion"," 1 can tuna fish"," grated cheese"],"directions":[" Mix together.  Bake one hour at 350.  When done, put cheese on top. "]},{"recipe_name":"Chicken Croquettes","ingredients":[" 6 oz. cream cheese"," 1/8 teaspoon pepper"," 2 cups cubed, cooked chicken or turkey"," 2/3 cup fresh mushrooms (4 oz. can)"," 2 packages Pillsbury crescent rolls"," 4 tablespoons butter"," 1 small package Pepperidge Farm Seasoned Stuffing"," 1/2 cup pecans"],"directions":[" Mix cream cheese, pepper, chicken, and mushrooms.  Undo rolls, put in filling.  Pinch sides together.  Roll in butter, then stuffing mix and pecans.  Bake 20 minutes at 350. "]},{"recipe_name":"Chili Verde","ingredients":[" 3-4 pounds chicken breasts or good quality pork roast (preferably with bone) "," 6 Anaheim (mild) peppers "," 3 Jalapeno (medium) peppers "," 1 medium onion (optional--more pepper flavor without) "," 2 cloves garlic "," 1 tablespoon cumin "," 2 cups chicken stock (or 2 cubes chicken bouillon and 2 cups water) "," 2 tablespoons flour "," Salt to taste "," 1-2 tablespoons sugar"],"directions":[" Put chicken or pork in crock pot.  Remove seeds from peppers (remember to wear gloves!) and add to pot.  Add onion, garlic, cumin, and then pour broth over all.  Cook for at least 5 hours on low (preferred) or 3 on high.  Remove meat from pot, de-bone and cut (or pull) into bite-size pieces.  Meanwhile, liquefy the remaining ingredients and add flour to thicken (I prefer to not bother chopping anything too much and just liquefy it all, which makes a thick green soup.  If you don't have children who are squeamish about onions or peppers, you could just chop everything fine and leave it as is).  Return meat to pot.  Salt to taste. Use sugar to adjust heat--adding more sugar will take the edge off any heat (really, it's amazing).  You can also adjust the heat by varying the ratio of Anaheims to Jalapenos, or substituting bell or hotter peppers. "]},{"recipe_name":"Chili, Spacemans Zesty","ingredients":[" 1 pound ground beef"," 1 teaspoon salt"," dash pepper"," 1 tablespoons instant minced onion"," 1 package brown gravy mix"," 3/4 cup water"," 2/3 cup catsup"," 1 fifteen ounce can chili bean in gravy"," 2 teaspoons prepared mustard"],"directions":[" Brown meat in large skillet.  Drain.  Add salt, pepper, onion, gravy mix, and water.  Stir well.  Bring to a boil, stirring constantly.  Stir in catsup, chili beans, and mustard.  Cover and simmer about 5 minutes. "]},{"recipe_name":"Chinese Chicken Sundaes","ingredients":[" 3/4 cup butter"," 3/4 cup flour"," 2 teaspoons salt"," 1/4 teaspoon pepper"," 3 cups chicken stock"," 2 cups half-and-half or milk"," 3 cups cooked chicken"," cooked rice"],"directions":[" Toppings: green onion tomatoes green pepper crushed pineapple coconut almonds or cashews chow mien noodles"," Melt butter, add flour, salt and pepper.  Cook on low, stirring until smooth.  Add stock and half-and-half; stir until well blended.  Add chicken and stir until thickened.Layer rice, creamed chicken and choice of toppings. "]},{"recipe_name":"Fried Rice","ingredients":[" 1 cup rice"," 11/2 cups water"," 1/2 cup peanut oil"," 1 egg, slightly beaten"," 1/4 cup cooked meat or shrimp"," 1 teaspoon salt"," 1/4 teaspoon pepper"," 1/4 cup green onions, chopped"," 11/2 tablespoons soy sauce"],"directions":[" Cook rice in water until done; let stand covered for 15 minutes.  Heat oil in skillet.  Add egg, cook for 2 minutes stirring to break into small pieces.  Add meat.  Add rest of ingredients.  Blend and cook over medium heat for 7 minutes.  (Serves 4) "]},{"recipe_name":"Hungarian Goulash (Cathy Stevens)","ingredients":[" 1/2 tablespoon butter"," 1 onion"," 2 pounds round steak, cut into 11/2 inch cubes"," 6 tablespoons flour"," 11/2 teaspoon paprika"," 11/2 teaspoon salt"," 1/2 teaspoon pepper"," 1 can tomatoes, mashed"],"directions":[" Saut onion in butter until golden.  Roll steak in flour and add to onion.  When brown on all sides, add paprika, salt, and pepper.  Add tomatoes, cover and simmer slowly until meat is tender.  Add up to 1 cup of water if too dry.  Remove cover and simmer until slightly thickened.  Serve over pasta or small potatoes.  If desired, top with sour cream. "]},{"recipe_name":"Jerk Chicken","ingredients":[" 1 tablespoon ground allspice"," 1 tablespoon dried leaf thyme"," 1 1/2 teaspoon cayenne pepper"," 1 1/2 teaspoon back pepper"," 1 1/2 teaspoon ground sage"," 3/4 teaspoon ground nutmeg"," 3/4 teaspoon ground cinnamon"," 2 tablespoon salt"," 2 tablespoon garlic powder"," 1 tablespoon sugar"," 1/4 cup olive oil"," 1/4 cup soy sauce"," 3/4 cup white vinegar"," 1/2 cup orange juice"," 1/4 cup fresh lime juice"," 1 scotch bonnet pepper"," 1 cup finely chopped white onion"," 3 green onions, finely chopped"," 4 (6-8oz.) whole chicken breasts, skinned and bones"],"directions":[" Mix together, marinate and grill.  Or throw everything in a crock pot (reduce the liquid). "]},{"recipe_name":"Lettuce Wraps","ingredients":[" 1 pound ground beef"," 1 large onion, chopped (about 1 cup)"," 2 tablespoons bottled, minced garlic"," 1 tablespoon reduced-sodium soy sauce"," 1/4 cup Hoisin sauce"," 2 teaspoons bottled ginger"," 1 tablespooon rice vinegar"," 2 teaspoons Asian chili pepper sauce (or 1/2 teaspoon red pepper flake)"," 1 can (8 ounces) sliced water chestnuts, drained"," 1 bunch scallions (3/4 cup)"," 2 teaspoons sesame oil"," 16 Boston, Bibb or butter lettuce leaves"],"directions":[" Brown beef and oinion.  Add soy sauce, Hoisin, ginger, vinegar, and pepper sauce, followed by water chestnuts, scallions, and sesame oil.  Cook 2 minutes until scallions wilt. "]},{"recipe_name":"Mexican Sundaes","ingredients":[" 1 pound hamburger, browned"," 1 diced onion"," 15 ounces tomato sauce"," 1/2-1 can water"," 2 cloves garlic, diced"," 2 teaspoons sugar"," 1 teaspoon accent"," 1 teaspoon oregano"," 1 teaspoon salt"," 4 cups cooked rice"],"directions":[" Simmer all of the above except rice for 30 minutes.  Add rice.  Serve hamburger mixture with tortilla chips, lettuce, dressing (below), tomatoes, and grated cheese."," Dressing: 4 ounces cream cheese 3/4 cup buttermilk 1 cup mayonnaise 1/2 teaspoon pepper 1/2 teaspoon accent 1/2 teaspoon garlic salt"," Mix together.  Best if you can let it sit overnight. "]},{"recipe_name":"Pasta: Alfredo","ingredients":[" 4 ounces cream cheese, cubed"," 1/2 cup grated parmesan cheese"," 3/4 cup milk"," 1/4 cup butter"," 1/4 teaspoon white pepper"," 1/8 teaspoon garlic powder"," salt to taste"," 8 ounces cooked, drained fettuccine"],"directions":[" Melt cream cheese, parmesan cheese milk, butter, white pepper, garlic powder, and salt in medium sauce pan.  Cook on low until cream cheese is melted and mixture is well blended.  Pour over fettuccine. "]},{"recipe_name":"Pasta: Lasagna","ingredients":[" 1/2 pound ground beef"," 1 3/4 cup tomatoes"," 1/2 cup tomato sauce"," 1 envelope spaghetti sauce mix"," 1 clove garlic, minced"," 4 oz. lasagna noodles"," 6 oz. mozzarella cheese, sliced"," 1/2 cup cottage cheese"," 1/4 cup Parmesan cheese"],"directions":[" Brown meat slowly, spoon off excess fat.  Add tomatoes, tomato sauce, spaghetti sauce mix, and garlic.  Cover and simmer for 25 minutes, stirring occasionally.  Salt to taste. Cook noodles in boiling, salted water for about 15 minutes.  Drain and rinse in cold water (do not overcook noodles).  Put half of noodles in bottom of baking dish, cover with 1/3 sauce, and add half mozzarella and cottage cheese.  Repeat, using another layer of noodles, cheese, and sauce.  Sprinkle Parmesan on top. "]},{"recipe_name":"Pasta: Macaroni and Cheese","ingredients":[" 2 cups water"," 1/4 teaspoon salt"," 1 cup elbow macaroni"," 1 cup sharp cheddar cheese, grated"," 2 tablespoons margarine"," 2 tablespoons heavy cream"],"directions":[" In a 2-quart saucepan, bring salted water to a boil.  Stir in macaroni, and return water to a boil.  Stirring occasionally, continue boiling for four minutes.  Lower the heat to medium and continue to boil the macaroni with infrequent stirring for 7 more minutes.  Add the cheese, margarine, and cream, stirring until the macaroni is melted.  Makes 2 one-cup servings. "]},{"recipe_name":"Pasta: Pasta Primavera","ingredients":[" 1/3 cup vegetable oil"," 1/4 pound mushrooms"," 1 medium onion, cut into thin wedges"," 2 cloves garlic, minced"," 1/2 pound broccoli, cut up"," 1 medium zucchini, sliced (2 cups)"," 2 carrots cut into thin strips (1 cup)"," 1/3 cup grape juice "," 3/4 teaspoon white wine vinegar"," 1/4 cup chopped parsley"," 1 teaspoon dried basil"," 1/2 teaspoon salt"," 1/8 teaspoon pepper"," 1/2 pound spaghetti (cooked)"," 1/2 cup grated Parmesan cheese"],"directions":[" In large skillet, heat oil over medium-high heat.  Add mushrooms, onion, and garlic, stirring frequently.  Cook 1-2 minutes.  Add broccoli, zucchini, and carrots, cook 2 to 3 minutes stirring frequently.  Add grape juice and vinegar, parsley, basil, salt and pepper.  Simmer 4 to 5 minutes or until vegetables are tender-crisp.  Toss together hot spaghetti, vegetables, and cheese. "]},{"recipe_name":"Pasta: Pico de Gallo","ingredients":[" 8 ounces rotini or other short pasta"," 3 very ripe large tomatoes (2 1/2 cups diced)"," 1/2 small sweet onion (1/3 cup diced)"," 2 jalapeno peppers (1/4 cup finely diced)"," 1/2 cup fresh cilantro leaves"," 3 garlic cloves"," juice from half a lime"," 1/2 teaspoon salt, or to taste"," Black pepper, to taste"," 3/4 cup shredded Monterey Jack cheese"],"directions":[" 1.Bring 2 1/2 quarts of unsalted water to a boil in a covered 4 1/2-quart Dutch oven or soup pot. When the water reaches a rapid boil, add the pasta, and cook just until tender, according to the package directions, about 9 to 11 minutes.  2.Meanwhile, core the tomatoes but do not peel them. Dice the tomatoes, trapping the juice in a bowl or on the cutting board. Add the tomato pieces and the tomato juice to a 3-quart or larger serving bowl. Peel the onion half, and finely dice it, adding the pieces to the bowl.  3.Remove the stems, seeds and membranes from the jalapeno peppers. (Wear rubber gloves, if you have them, while working with jalapeno peppers.) Finely dice the peppers, using enough to make about 1/4 cup. Add the jalapenos to the bowl.  4.Finely chop the cilantro leaves, and add them to the bowl. Peel and finely mince the garlic, and add it to the bowl. Squeeze the juice from the lime half into the bowl. Sprinkle the salt and black pepper over the tomato mixture. Stir to mix all of the ingredients well.  5.When the pasta is done, drain it into a colander, and shake the colander to remove as much water as possible. Add the hot, drained pasta to the serving bowl with the tomato mixture. Sprinkle the cheese over the pasta, and stir to thoroughly mix all of the ingredients. Serve at once. "]},{"recipe_name":"Pasta: Peanut Chicken Pasta","ingredients":[" 12 oz. thin spaghetti"," 12 oz.-1 lb. grilled or roasted chicken (cold)"," 1 medium red bell pepper (1 cup chopped)"," 4 scallions (1/2 cup chopped)"," 1 cup Easy Blender Peanut Sauce"],"directions":[" Cook spaghetti.  Cut chicken into bite size pieces, place in 3-quart bowl.  Rinse, seed, and cut pepper into bite size pieces.  Add to chicken.  Cut scallions into 1/4 inch slices, using whites and enough tender greens to make 1/2 cup.  Add to bowl.  Toss to mix.  Microwave peanut sauce 1-2 minutes until heated through.  Drain spaghetti, add to bowl.  Drizzle peanut sauce over.  Toss well.  Serves 4."," Easy Blender Peanut Sauce 4 cloves fresh garlic juice from 1/2 lemon 1/2 cup creamy peanut butter 1/4 cup water 1/4 cup ketchup 1/4 cup soy sauce 1/4 cup brown sugar 2 tablespoons peanut (or other) oil 4 teaspoons bottled ground ginger (or fresh) 1 tablespoon red wine vinegar 1 tablespoon sesame oil 1/2 teaspoon crushed red pepper (or to taste)"," Peel garlic.  Chop finely in blender.  Add rest of the ingredients.  Pulse at high just until combined (about 5 seconds).  Scrape sides and repeat 3-4 times.  Serve at once or refrigerate in microwave-ready container for up to 1 week.  Makes 1 3/4 cup. "]},{"recipe_name":"Pasta: Spaghetti alla Checca (uncooked tomato sauce)","ingredients":[" 5 tomatoes diced"," 4 garlic cloves, minced"," 1/2 cup chopped fresh basil"," 1/2 cup extra virgin olive oil"," salt"," parmesan cheese, grated"," 1 pound spaghetti"],"directions":[" Combine tomatoes, garlic, basil, olive oil, and salt in a medium bowl.  Cover and let stand at room temperature at least 2 hours stirring occasionally.   Cook pasta, pour sauce over hot pasta and add parmesan cheese. "]},{"recipe_name":"Pasta: Sweet Tomato-Basil Sauce","ingredients":[" 2 tablespoons olive oil"," 1 1/2 tablespoons butter"," 5 tomatoes peeled and diced"," 3 large parsley sprigs, chopped fine"," 8 large basil leaves chopped"," 1 to 2 garlic cloves, minced"," salt and pepper to taste"],"directions":[" Heat oil and butter over medium high heat.  Add tomatoes, simmer about 1 minute.  Add parsley, garlic, basil, garlic, salt and pepper and cook gently about 2 minutes until herbs are limp.  Remove from heat and toss with just-cooked fresh pasta. "]},{"recipe_name":"Pasta: Tomato and Basil Sauce","ingredients":[" 2 pounds ripe tomatoes"," 1/2 teaspoon salt"," 2 cloves garlic, minced"," 1/2 cup chopped fresh basil leaves"," 1/2 cup chopped fresh parsley"," 2 tablespoons olive oil"," 1/4 teaspoon freshly ground black pepper"," 1/4 teaspoon crushed dried red pepper (to taste)"],"directions":[" Plunge tomatoes in boiling water for 10 seconds to peel easily.  Peel and dice tomatoes (about 4 cups).  Sprinkle with salt and mix well.  Place salted tomatoes in a colander and allow to drain for 2 hours.  Combine the garlic, basil, parsley, oil, and peppers.  Add the drained tomatoes and mix well.  Serve over pasta.  Also good on rice, fish, or poultry. (Note: secret to recipe is to let tomatoes drain.  Another trick is to freeze ripe tomatoes, then put them in cold water to peel them.) "]},{"recipe_name":"Pizza: Cheesy Lasagna","ingredients":[" 1 pound ground beef"," 1/4 cup water"," 1 envelope (1.5 oz.) spaghetti sauce mix"," 8 oz can tomato sauce"],"directions":[" Brown and drain hamburger.  Add water, spaghetti sauce, and tomato sauce.  Let simmer and prepare crust."," Crust: 1 package Hot Roll mix.  Dissolve yeast in large bowl with 1 cup warm water (105-115).  Add flour mixture and blend well.  Press dough on greased pan, forming a high rim."," 1 1/2 cup cream style cottage cheese 1/4 cup Parmesan cheese 4 oz (1 cup) shredded mozzarella cheese"," Spread crust with cottage cheese.  Spoon meat mixture over cheese.  Sprinkle with Parmesan cheese.  Bake 25-35 minutes on low rack in oven (400).  Sprinkle with mozzarella cheese.  Bake 2-3 minutes until cheese melts.  Let stand 5 minutes before serving. "]},{"recipe_name":"Salad: Chicken Salad","ingredients":[" 1 package chicken ramen noodles"," 4 teaspoons slivered almonds"," 1-2 tablespoons butter"," 1 large head cabbage, chopped fine"," 4-6 chopped green onions"," 2 chicken breasts, cooked and chopped"],"directions":[" Brown noodles and almonds in butter.  Mix ingredients in large salad bowl.  Pour dressing over all and mix.  Allow to sit in refrigerator overnight.  Serves 10."," Dressing 4 tablespoons sugar 6 tablespoons cider vinegar 1 cup oil 2 teaspoons salt 2 teaspoons Accent 1/2 teaspoon black pepper seasoning from noodles"," Dressing (low fat alternative) 1/2 cup rice wine vinegar 1/3 cups sugar 2 tablespoons soy sauce 1 teaspoon dark sesame oil"," Mix together with wire whip before pouring over salad. "]},{"recipe_name":"Salad: Oriental Salad (Mary Junes)","ingredients":[" 1 quart iceberg lettuce"," 1 quart romaine lettuce"," 4 stalks green onion"," 2 tablespoons toasted, chopped almonds"," 2 tablespoons toasted sesame seeds"," 4 oz. Wonton wraps, deep fried"," 1 oz. Rice sticks (Maifun), deep fried"," 1-2 cups grilled chicken, cubed"," 6 pickled scallions, diced"," 1/2 cup water chestnuts"],"directions":[" Dressing 3 tablespoons sugar 1 teaspoon salt 1/2 teaspoon pepper 2 tablespoons sesame oil 1/4 cup salad oil 3 tablespoons rice vinegar 2 teaspoons soy sauce 1/2 teaspoon dry mustard several drops of Mongolian fire oil "]},{"recipe_name":"Swedish Meatballs (Lynette)","ingredients":[" 2 cups soft bread crumbs"," 1/4 cup milk"," 1/2 cup chopped onion"," 4 tablespoons (2+2) butter"," 2 eggs"," 3/4 pound ground beef"," 1/2 pound ground ham"," 1 cup + 3/4 cup half-and-half"," 1/4 cup finely chopped parsley"," 1 teaspoon salt"," 1/4 teaspoon ginger"," 1 tablespoon flour"," 1/2 teaspoon concentrated meat extract"," 1 teaspoon Accent (msg)"],"directions":[" Soak bread in milk for 5 minutes.  Cook onion in 2 tablespoons butter until tender but not brown.  Combine eggs, meats, crumbs, onion, 1 cup half-and-half, parsley, salt, and ginger.  Beat vigorously until fluffy (5 minutes with electric mixer).  Form in 1 inch balls.  Brown and cook in 2 tablespoons butter.  Remove meatballs.  Stir flour into drippings, add remaining half-and-half, meat extract, and Accent.  Heat and stir until gravy thickens.  Return meat balls to gravy, simmer uncovered about 10 minutes.  Add more milk if needed.  Makes 5 dozen. "]},{"recipe_name":"Tomatoes Provencal","ingredients":[" 2 large ripe tomatoes"," 2 slices white bread"," 2 garlic cloves, minced"," 1 tablespoon fresh basil"," 2 tablespoons fresh parsley"," 2 teaspoons fresh chives"," salt"," freshly ground pepper"," 6 tablespoons olive oil"],"directions":[" Preheat oven to 375.  Core each tomato, cutting only as deep as necessary.  Cut in half horizontally and gently squeeze to remove seeds and juice. Lightly toast bread, then tear into pieces and process in food processor to make crumbs.Combine crumbs with garlic, basil, parsley, chives, salt, and pepper.  Moisten with 4 tablespoons of olive oil. Fill each tomato half with the crumb mixture, putting it into cavities and mounding on top.  Place in lightly oiled shallow baking disk.  Drizzle remaining 2 tablespoons olive oil over the top.  Bake 20 to 30 minutes until stuffing is golden and tomatoes are juicy. "]},{"recipe_name":"Zesty Pork Stew","ingredients":[" 1 pound pork tenderloin, cut into 1-inch cubes"," 2 medium sweet potatoes, peeled and cubed (2 cups)"," 1 medium green bell pepper, chopped (1 cup)"," 2 cloves garlic, finely chopped"," 1 cup coarsely chopped cabbage"," 1 teaspoon Cajun seasoning"," 14 1/2-ounce can chicken broth"],"directions":[" Spray 4-quart Dutch oven with cooking spray; heat over medium-high heat. Cook pork in Dutch oven, stirring occasionally, until brown.  Stir in remaining ingredients. Heat to boiling; reduce heat. Cover and simmer about 15 minutes, stirring once, until sweet potatoes are tender. Makes 4 servings."]}]}