{"Soup":[{"recipe_name":"French Onion","ingredients":[" 2 cans (14 1/2 oz.) beef broth"," 1 can (14 1/2 oz.) fat free chicken broth"," 1/4 cup white grape juice"," 1 tablespoon Worcestershire sauce"," 1 garlic clove"," 1/4 teaspoon dried thyme"," 2 cups caramelized onions with juice (see below)"],"directions":[" Put all ingredients except onions into a 4 1/2-quart Dutch oven or soup pot.  Stir and heat over high heat until boiling.  Add onions.  Cover, reduce heat to medium, and boil for 1 minute.Divide soup into 4 ovenproof bowls.  Put slice of bread in each bowl, layer with slice of Swiss cheese and sprinkle with 1-teaspoon Parmesan cheese.  Place under broiler for 1 minute or until cheese melts.  Serve at once."," Caramelized Onions Place 6 sliced onions in slow cooker.  Drizzle with olive oil and (optionally) sprinkle with brown sugar.  Cook on low heat for 8 to 10 hours.  Left over onions can be refrigerated and used later. "]},{"recipe_name":"Ham and White Bean","ingredients":[" 2 cups white beans"," 1 ham bone"," 1/2 small onion chopped"," 1 carrot grated"," 2 medium potatoes diced"," Salt and pepper"],"directions":[" Soak beans overnight, if needed, then drain water.  Put beans, ham bone, and onion in crock pot.  Add 6 cups water (about triple the volume of the beans, enough to cover the ham bone) and cook on low for 4 hours.  Pull ham off bone and add additional ham pieces if desired.  Add carrot and potatoes, continue to cook for a couple of hours longer.  Salt and pepper to taste.  Cooks note: last time I made this, we used a ham that came with a sugary glaze.  I added some of glazed edge of the ham and some of the gelatinous drippings and it came out good.  Try not to get it too sweet.  Also note you could leave this cooking all day at work, microwave the potatoes and onions and toss them in at the end. "]},{"recipe_name":"Meaty Bean Soup","ingredients":[" 1cup dry pinto beans"," 1/2 up dry red beans"," 1/2 cup dry garbanzo beans"," 1  11/2 pounds ham hocks"," 11/2 cup celery"," 1 cup chopped onion"," 2 cloves garlic, minced"," 2 bay leaves"," 1/4 teaspoon ground red pepper"," 1/2 pound smoked sausage, sliced and cooked"," 1 pound chicken thighs or 2 breasts"," 3 tablespoons parsley"],"directions":[" Rinse beans.  Cover and soak (or bring to boil and let stand for 1 hour).  Drain.  Add 7 cups of water and ham hocks.  Simmer 1 hour. Cut off meat, discard bones.  Add tomatoes, celery, onion, garlic, bay leaves, and pepper.  Add sausage and chicken.  Boil and reduce heat.  Cover and simmer 1 hour or until tender.  Cool chicken slightly. Chop and return meat to soup.  Add parsley.  Serves 8-10. "]},{"recipe_name":"Potato Cheese Soup (Virgie)","ingredients":[" 6-8 medium potatoes, diced"," 2 cups water + 2 chicken bullion cubes"," (or 1 can chicken broth)"," 1/2 pound Velveeta cheese, cubed"," (or 1 cup cheddar cheese, grated)"," 1 can cream of mushroom soup"," 1 can cream of chicken soup"," 1 can canned milk"," bell peppers or parsley for garnish"],"directions":[" Boil potatoes in chicken broth.  Partially mash when soft.  Add cheese, soups, and milk.  Heat through. "]},{"recipe_name":"Taco (Grandma Armstrong)","ingredients":[" 1 pound ground beef"," 1 medium onion, chopped fine"," 2 cans (1 quart) stewed tomatoes"," 8 oz. can tomato sauce"," 1 cup water"," 1 can (15 oz.) kidney beans"," 2 tablespoons taco seasoning"],"directions":[" Brown meat and onion.  Add remaining ingredients and bring to a boil.  Serve hot with corn chips, grated cheddar cheese, and sour cream. "]},{"recipe_name":"Tomato Bisque","ingredients":[" 4 large shallots"," 1 1/2 teaspoon garlic"," 1 jumbo carrot"," 1 medium onion"," 1/4 cup olive oil"," 4 cups white grape juice"," 1 1/2 quarts stewed tomatoes (with basil and oregano) = 4 15 oz. cans"," 1 1/2 quarts vegetable stock (4 Knorr bouillon cubes and 6 cups water)"," 2 cups cream"," salt and pepper"," Parmesan cheese"," Fresh thyme"],"directions":[" Mince shallots, garlic, carrot, and onion in food processor until fine.  Saut in olive oil.  Sweat it by cooking for 5 to 8 minutes.  Add grape juice and bring to a boil.  Continue to boil until liquid reduces by half. Add stock and bring to a boil.  Puree.  Add cream, bring back to boil.  Season with salt and pepper.  Garnish with cheese and thyme. "]},{"recipe_name":"Tomato, Creamy Tomato with Herbs","ingredients":[" 1 teaspoon olive oil"," 1 small onion chopped (1/2 cup)"," 1 clove garlic"," 2 cans (14 1/2 ounce each) chopped tomatoes with basil, garlic, and oregano (Del Monte) or"," 2 cans (14 1/2 ounce each) chopped tomatoes with 1/2 teaspoon basil and 1/2 teaspoon oregano"," 1 can (15 ounce) tomato sauce"," 1 cup milk"," 1/4 cup grated Parmesan cheese"],"directions":[" In soup pot, heat oil and heat onion over medium heat for 2 minutes. Add garlic and cook for 30 seconds. Add tomatoes and their juice, and tomato sauce. Raise heat to high and bring to boil. Reduce heat to low, stir in milk and Parmesan cheese. Stir and cook for 2 minutes (do not boil). "]},{"recipe_name":"Turkey, Williamsburg","ingredients":[" 1 onion"," 3 stalks celery"," 2 carrots"," 1 cup butter"," 1 1/2 cups flour"," 3 quarts turkey stock"," 1 pint light cream"," 1/2 - 1 cup turkey"," 1 cup cooked rice"],"directions":[" Chop onion, celery, and carrots and cook with water.  Melt butter and add flour to it.  Heat turkey stock and cream in large pan.  Gradually add butter and flour mixture, stirring until all the lumps are gone.  Add vegetables and cook 10-15 minutes.  Add turkey and rice and heat through. "]},{"recipe_name":"Wild rice (Diana Carlston)","ingredients":[" 1 box Uncle Bens Wild Rice (original or quick), cooked"," 2 tablespoons butter"," 1 tablespoon minced onions"," 1/3 cup flour"," 4 cups (2 cans) chicken broth"," 2 cups cooked chicken, cubed"," 1 cup half and half or milk"],"directions":[" Melt butter and saut onions, then add flour, then chicken broth.  Bring to a boil for one minute.  Add rice and chicken, simmer 5 minutes.  Add half and half.  Heat to serve. "]},{"recipe_name":"Zucchini (mine, not the one at Kylees wedding)","ingredients":[" 4-6 medium zucchini"," 6 Anaheim (mild) peppers"," 3 Jalapeno (medium) peppers"," 2 cloves garlic"," 2 cups chicken stock"," Salt to taste"," 1-2 tablespoons sugar"," 1 can (12 oz) coconut milk (low fat is fine)"],"directions":[" Boil zucchini, peppers, garlic, and stock in 8 quart saucepan until very soft, then liquify it. Add salt to taste and sugar to adjust heat (adding more will take the edge off any heat). Stir in coconut milk and warm. Also good with boiled potatoes or broccoli added. "]},{"recipe_name":"White Chicken Chili (Jeanette Clark)","ingredients":[" 4 boneless chicken breasts"," 2 1/2 cups water"," 1 teaspoon lemon pepper"," 1 teaspoon cumin seed"],"directions":[" Combine above ingredients and simmer 30-45 minutes.  Remove chicken and cut up.  Skim fat from broth and add chicken."," 1 clove garlic 1 cup chopped onion 2 eight ounce cans white corn, drained 1 four ounce can green chilies 1 teaspoon cumin 2-3 tablespoons lime juice 2 fourteen ounce can white or great northern beans (dont drain)"," Saut onion and garlic until tender.  Add all ingredients except beans to chicken and broth, and bring to boil.  Add beans and simmer until heated through, about 30-45 minutes.  Serve with tortilla chips, Monterey Jack cheese or sour cream, salsa. "]}]}